IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_xbar_regs.xml
	<register id="XBARFLG3" width="32" page="1" offset="0x4" internal="0" description="X-Bar Input Flag Register 3">
		<bitfield id="ADCCEVT2" description="Input Flag for ADCCEVT2 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ADCCEVT3" description="Input Flag for ADCCEVT3 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ADCCEVT4" description="Input Flag for ADCCEVT4 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT1_COMPL" description="Input Flag for SD1FLT1.COMPL Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT1_COMPH" description="Input Flag for SD1FLT1.COMPH Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT2_COMPL" description="Input Flag for SD1FLT2.COMPL Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT2_COMPH" description="Input Flag for SD1FLT2.COMPH Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT3_COMPL" description="Input Flag for SD1FLT3.COMPL Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT3_COMPH" description="Input Flag for SD1FLT3.COMPH Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT4_COMPL" description="Input Flag for SD1FLT4.COMPL Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT4_COMPH" description="Input Flag for SD1FLT4.COMPH Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT1_COMPL" description="Input Flag for SD2FLT1.COMPL Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT1_COMPH" description="Input Flag for SD2FLT1.COMPH Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT2_COMPL" description="Input Flag for SD2FLT2.COMPL Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT2_COMPH" description="Input Flag for SD2FLT2.COMPH Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT3_COMPL" description="Input Flag for SD2FLT3.COMPL Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT3_COMPH" description="Input Flag for SD2FLT3.COMPH Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT4_COMPL" description="Input Flag for SD2FLT4.COMPL Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT4_COMPH" description="Input Flag for SD2FLT4.COMPH Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="ECAP7_OUT" description="Input Flag for ECAP7.OUT Signal" begin="23" end="23" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG4" width="32" page="1" offset="0x6" internal="0" description="X-Bar Input Flag Register 4">
		<bitfield id="MCANA_FEVT0" description="Input Flag for MCANA_FEVT0 Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="MCANA_FEVT1" description="Input Flag for MCANA_FEVT1 Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="MCANA_FEVT2" description="Input Flag for MCANA_FEVT2 Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT4" description="Input Flag for CLB1_4.1 Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT5" description="Input Flag for CLB1_5.1 Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT4" description="Input Flag for CLB2_4.1 Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT5" description="Input Flag for CLB2_5.1 Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT4" description="Input Flag for CLB3_4.1 Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT5" description="Input Flag for CLB3_5.1 Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT4" description="Input Flag for CLB4_4.1 Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT5" description="Input Flag for CLB4_5.1 Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT4" description="Input Latch for CLB5_OUT4 Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT5" description="Input Latch for CLB5_OUT5 Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT4" description="Input Latch for CLB6_OUT4 Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT5" description="Input Latch for CLB6_OUT5 Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="ERRORSTS_ERROR" description="Input Latch for ERRORSTS_ERROR Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="ECATSYNC0" description="Input Latch for ECATSYNC0 Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="ECATSYNC1" description="Input Latch for ECATSYNC1 Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="CLAHALT" description="Input Latch for CLAHALT Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG5" width="32" page="1" offset="0x8" internal="0" description="X-Bar Input Flag Register 5">
		<bitfield id="EPWM1_TRIPOUT" description="Input Flag for EPWM1_TRIPOUT Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EPWM2_TRIPOUT" description="Input Flag for EPWM2_TRIPOUT Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EPWM3_TRIPOUT" description="Input Flag for EPWM3_TRIPOUT Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EPWM4_TRIPOUT" description="Input Flag for EPWM4_TRIPOUT Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EPWM5_TRIPOUT" description="Input Flag for EPWM5_TRIPOUT Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EPWM6_TRIPOUT" description="Input Flag for EPWM6_TRIPOUT Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EPWM7_TRIPOUT" description="Input Flag for EPWM7_TRIPOUT Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EPWM8_TRIPOUT" description="Input Flag for EPWM8_TRIPOUT Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EPWM9_TRIPOUT" description="Input Flag for EPWM9_TRIPOUT Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EPWM10_TRIPOUT" description="Input Flag for EPWM10_TRIPOUT Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EPWM11_TRIPOUT" description="Input Flag for EPWM11_TRIPOUT Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EPWM12_TRIPOUT" description="Input Flag for EPWM12_TRIPOUT Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EPWM13_TRIPOUT" description="Input Flag for EPWM13_TRIPOUT Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EPWM14_TRIPOUT" description="Input Flag for EPWM14_TRIPOUT Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EPWM15_TRIPOUT" description="Input Flag for EPWM15_TRIPOUT Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EPWM16_TRIPOUT" description="Input Flag for EPWM16_TRIPOUT Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="EPWM17_TRIPOUT" description="Input Flag for EPWM17_TRIPOUT Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EPWM18_TRIPOUT" description="Input Flag for EPWM18_TRIPOUT Signal" begin="17" end="17" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG6" width="32" page="1" offset="0xa" internal="0" description="X-Bar Input Flag Register 6">
		<bitfield id="EPWM1_DEL_TRIP" description="Input Flag for EPWM1_DEL_TRIP Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EPWM2_DEL_TRIP" description="Input Flag for EPWM2_DEL_TRIP Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EPWM3_DEL_TRIP" description="Input Flag for EPWM3_DEL_TRIP Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EPWM4_DEL_TRIP" description="Input Flag for EPWM4_DEL_TRIP Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EPWM5_DEL_TRIP" description="Input Flag for EPWM5_DEL_TRIP Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EPWM6_DEL_TRIP" description="Input Flag for EPWM6_DEL_TRIP Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EPWM7_DEL_TRIP" description="Input Flag for EPWM7_DEL_TRIP Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EPWM8_DEL_TRIP" description="Input Flag for EPWM8_DEL_TRIP Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EPWM9_DEL_TRIP" description="Input Flag for EPWM9_DEL_TRIP Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EPWM10_DEL_TRIP" description="Input Flag for EPWM10_DEL_TRIP Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EPWM11_DEL_TRIP" description="Input Flag for EPWM11_DEL_TRIP Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EPWM12_DEL_TRIP" description="Input Flag for EPWM12_DEL_TRIP Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EPWM13_DEL_TRIP" description="Input Flag for EPWM13_DEL_TRIP Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EPWM14_DEL_TRIP" description="Input Flag for EPWM14_DEL_TRIP Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EPWM15_DEL_TRIP" description="Input Flag for EPWM15_DEL_TRIP Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EPWM16_DEL_TRIP" description="Input Flag for EPWM16_DEL_TRIP Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="EPWM17_DEL_TRIP" description="Input Flag for EPWM17_DEL_TRIP Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EPWM18_DEL_TRIP" description="Input Flag for EPWM18_DEL_TRIP Signal" begin="17" end="17" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG7" width="32" page="1" offset="0xc" internal="0" description="X-Bar Input Flag Register 7">
		<bitfield id="EPWM1_DEL_ACTIVE" description="Input Flag for EPWM1_DEL_ACTIVE Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EPWM2_DEL_ACTIVE" description="Input Flag for EPWM2_DEL_ACTIVE Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EPWM3_DEL_ACTIVE" description="Input Flag for EPWM3_DEL_ACTIVE Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EPWM4_DEL_ACTIVE" description="Input Flag for EPWM4_DEL_ACTIVE Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EPWM5_DEL_ACTIVE" description="Input Flag for EPWM5_DEL_ACTIVE Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EPWM6_DEL_ACTIVE" description="Input Flag for EPWM6_DEL_ACTIVE Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EPWM7_DEL_ACTIVE" description="Input Flag for EPWM7_DEL_ACTIVE Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EPWM8_DEL_ACTIVE" description="Input Flag for EPWM8_DEL_ACTIVE Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EPWM9_DEL_ACTIVE" description="Input Flag for EPWM9_DEL_ACTIVE Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EPWM10_DEL_ACTIVE" description="Input Flag for EPWM10_DEL_ACTIVE Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EPWM11_DEL_ACTIVE" description="Input Flag for EPWM11_DEL_ACTIVE Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EPWM12_DEL_ACTIVE" description="Input Flag for EPWM12_DEL_ACTIVE Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EPWM13_DEL_ACTIVE" description="Input Flag for EPWM13_DEL_ACTIVE Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EPWM14_DEL_ACTIVE" description="Input Flag for EPWM14_DEL_ACTIVE Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EPWM15_DEL_ACTIVE" description="Input Flag for EPWM15_DEL_ACTIVE Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="EPWM16_DEL_ACTIVE" description="Input Flag for EPWM16_DEL_ACTIVE Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="EPWM17_DEL_ACTIVE" description="Input Flag for EPWM17_DEL_ACTIVE Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EPWM18_DEL_ACTIVE" description="Input Flag for EPWM18_DEL_ACTIVE Signal" begin="17" end="17" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG8" width="32" page="1" offset="0xe" internal="0" description="X-Bar Input Flag Register 8">
		<bitfield id="ETPWM1_A0_sclk" description="Input Flag for ETPWM1_A0_sclk Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ETPWM1_B0_sclk" description="Input Flag for ETPWM1_B0_sclk Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ETPWM2_A0_sclk" description="Input Flag for ETPWM2_A0_sclk Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ETPWM2_B0_sclk" description="Input Flag for ETPWM2_B0_sclk Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ETPWM3_A0_sclk" description="Input Flag for ETPWM3_A0_sclk Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ETPWM3_B0_sclk" description="Input Flag for ETPWM3_B0_sclk Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ETPWM4_A0_sclk" description="Input Flag for ETPWM4_A0_sclk Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ETPWM4_B0_sclk" description="Input Flag for ETPWM4_B0_sclk Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="ETPWM5_A0_sclk" description="Input Flag for ETPWM5_A0_sclk Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="ETPWM5_B0_sclk" description="Input Flag for ETPWM5_B0_sclk Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="ETPWM6_A0_sclk" description="Input Flag for ETPWM6_A0_sclk Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="ETPWM6_B0_sclk" description="Input Flag for ETPWM6_B0_sclk Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="ETPWM7_A0_sclk" description="Input Flag for ETPWM7_A0_sclk Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="ETPWM7_B0_sclk" description="Input Flag for ETPWM7_B0_sclk Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="ETPWM8_A0_sclk" description="Input Flag for ETPWM8_A0_sclk Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="ETPWM8_B0_sclk" description="Input Flag for ETPWM8_B0_sclk Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="ETPWM9_A0_sclk" description="Input Flag for ETPWM9_A0_sclk Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="ETPWM9_B0_sclk" description="Input Flag for ETPWM9_B0_sclk Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="ETPWM10_A0_sclk" description="Input Flag for ETPWM10_A0_sclk Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="ETPWM10_B0_sclk" description="Input Flag for ETPWM10_B0_sclk Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="ETPWM11_A0_sclk" description="Input Flag for ETPWM11_A0_sclk Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="ETPWM11_B0_sclk" description="Input Flag for ETPWM11_B0_sclk Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="ETPWM12_A0_sclk" description="Input Flag for ETPWM12_A0_sclk Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="ETPWM12_B0_sclk" description="Input Flag for ETPWM12_B0_sclk Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="ETPWM13_A0_sclk" description="Input Flag for ETPWM13_A0_sclk Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="ETPWM13_B0_sclk" description="Input Flag for ETPWM13_B0_sclk Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="ETPWM14_A0_sclk" description="Input Flag for ETPWM14_A0_sclk Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="ETPWM14_B0_sclk" description="Input Flag for ETPWM14_B0_sclk Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="ETPWM15_A0_sclk" description="Input Flag for ETPWM15_A0_sclk Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="ETPWM15_B0_sclk" description="Input Flag for ETPWM15_B0_sclk Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="ETPWM16_A0_sclk" description="Input Flag for ETPWM16_A0_sclk Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="ETPWM16_B0_sclk" description="Input Flag for ETPWM16_B0_sclk Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
