IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_xbar_regs.xml
	<register id="XBARFLG9" width="32" page="1" offset="0x10" internal="0" description="X-Bar Input Flag Register 9">
		<bitfield id="ETPWM17_A0_sclk" description="Input Flag for ETPWM17_A0_sclk Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ETPWM17_B0_sclk" description="Input Flag for ETPWM17_B0_sclk Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ETPWM18_A0_sclk" description="Input Flag for ETPWM18_A0_sclk Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ETPWM18_B0_sclk" description="Input Flag for ETPWM18_B0_sclk Signal" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG10" width="32" page="1" offset="0x12" internal="0" description="X-Bar Input Flag Register 10">
		<bitfield id="MDL1_OUTA" description="Input Flag for MDL1_OUTA Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MDL1_OUTB" description="Input Flag for MDL1_OUTB Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MDL2_OUTA" description="Input Flag for MDL2_OUTA Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="MDL2_OUTB" description="Input Flag for MDL2_OUTB Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="MDL3_OUTA" description="Input Flag for MDL3_OUTA Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="MDL3_OUTB" description="Input Flag for MDL3_OUTB Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="MDL4_OUTA" description="Input Flag for MDL4_OUTA Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="MDL4_OUTB" description="Input Flag for MDL4_OUTB Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="MDL5_OUTA" description="Input Flag for MDL5_OUTA Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="MDL5_OUTB" description="Input Flag for MDL5_OUTB Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="MDL6_OUTA" description="Input Flag for MDL6_OUTA Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="MDL6_OUTB" description="Input Flag for MDL6_OUTB Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="MDL7_OUTA" description="Input Flag for MDL7_OUTA Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="MDL7_OUTB" description="Input Flag for MDL7_OUTB Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="MDL8_OUTA" description="Input Flag for MDL8_OUTA Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="MDL8_OUTB" description="Input Flag for MDL8_OUTB Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="MDL9_OUTA" description="Input Flag for MDL9_OUTA Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="MDL9_OUTB" description="Input Flag for MDL9_OUTB Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="MDL10_OUTA" description="Input Flag for MDL10_OUTA Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="MDL10_OUTB" description="Input Flag for MDL10_OUTB Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="MDL11_OUTA" description="Input Flag for MDL11_OUTA Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="MDL11_OUTB" description="Input Flag for MDL11_OUTB Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="MDL12_OUTA" description="Input Flag for MDL12_OUTA Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="MDL12_OUTB" description="Input Flag for MDL12_OUTB Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="MDL13_OUTA" description="Input Flag for MDL13_OUTA Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="MDL13_OUTB" description="Input Flag for MDL13_OUTB Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="MDL14_OUTA" description="Input Flag for MDL14_OUTA Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="MDL14_OUTB" description="Input Flag for MDL14_OUTB Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="MDL15_OUTA" description="Input Flag for MDL15_OUTA Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="MDL15_OUTB" description="Input Flag for MDL15_OUTB Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="MDL16_OUTA" description="Input Flag for MDL16_OUTA Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="MDL16_OUTB" description="Input Flag for MDL16_OUTB Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG11" width="32" page="1" offset="0x14" internal="0" description="X-Bar Input Flag Register 11">
		<bitfield id="MDL17_OUTA" description="Input Flag for MDL17_OUTA Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MDL17_OUTB" description="Input Flag for MDL17_OUTB Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MDL18_OUTA" description="Input Flag for MDL18_OUTA Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="MDL18_OUTB" description="Input Flag for MDL18_OUTB Signal" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG12" width="32" page="1" offset="0x16" internal="0" description="X-Bar Input Flag Register 12">
		<bitfield id="CLB1_OUT0" description="Input Flag for CLB1_OUT0 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT1" description="Input Flag for CLB1_OUT1 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT2" description="Input Flag for CLB1_OUT2 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT3" description="Input Flag for CLB1_OUT3 Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT6" description="Input Flag for CLB1_OUT6 Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CLB1_OUT7" description="Input Flag for CLB1_OUT7 Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT0" description="Input Flag for CLB2_OUT0 Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT1" description="Input Flag for CLB2_OUT1 Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT2" description="Input Flag for CLB2_OUT2 Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT3" description="Input Flag for CLB2_OUT3 Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT6" description="Input Flag for CLB2_OUT6 Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CLB2_OUT7" description="Input Flag for CLB2_OUT7 Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT0" description="Input Flag for CLB3_OUT0 Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT1" description="Input Flag for CLB3_OUT1 Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT2" description="Input Flag for CLB3_OUT2 Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT3" description="Input Flag for CLB3_OUT3 Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT6" description="Input Flag for CLB3_OUT6 Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CLB3_OUT7" description="Input Flag for CLB3_OUT7 Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT0" description="Input Flag for CLB4_OUT0 Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT1" description="Input Flag for CLB4_OUT1 Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT2" description="Input Flag for CLB4_OUT2 Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT3" description="Input Flag for CLB4_OUT3 Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT6" description="Input Flag for CLB4_OUT6 Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="CLB4_OUT7" description="Input Flag for CLB4_OUT7 Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT0" description="Input Flag for CLB5_OUT0 Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT1" description="Input Flag for CLB5_OUT1 Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT2" description="Input Flag for CLB5_OUT2 Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT3" description="Input Flag for CLB5_OUT3 Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT6" description="Input Flag for CLB5_OUT6 Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="CLB5_OUT7" description="Input Flag for CLB5_OUT7 Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT0" description="Input Flag for CLB6_OUT0 Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT1" description="Input Flag for CLB6_OUT1 Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG13" width="32" page="1" offset="0x18" internal="0" description="X-Bar Input Flag Register 13">
		<bitfield id="CLB6_OUT2" description="Input Flag for CLB6_OUT2 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT3" description="Input Flag for CLB6_OUT3 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT6" description="Input Flag for CLB6_OUT6 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CLB6_OUT7" description="Input Flag for CLB6_OUT7 Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="XTRIPOUT1" description="Input Flag for XTRIPOUT1 Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="XTRIPOUT2" description="Input Flag for XTRIPOUT2 Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="XTRIPOUT3" description="Input Flag for XTRIPOUT3 Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="XTRIPOUT4" description="Input Flag for XTRIPOUT4 Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="XTRIPOUT5" description="Input Flag for XTRIPOUT5 Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="XTRIPOUT6" description="Input Flag for XTRIPOUT6 Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="XTRIPOUT7" description="Input Flag for XTRIPOUT7 Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="XTRIPOUT8" description="Input Flag for XTRIPOUT8 Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="ADCA_EXTMUXSEL0" description="Input Flag for ADCA_EXTMUXSEL0 Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="ADCA_EXTMUXSEL1" description="Input Flag for ADCA_EXTMUXSEL1 Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="ADCA_EXTMUXSEL2" description="Input Flag for ADCA_EXTMUXSEL2 Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="ADCA_EXTMUXSEL3" description="Input Flag for ADCA_EXTMUXSEL3 Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="ADCB_EXTMUXSEL0" description="Input Flag for ADCB_EXTMUXSEL0 Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="ADCB_EXTMUXSEL1" description="Input Flag for ADCB_EXTMUXSEL1 Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="ADCB_EXTMUXSEL2" description="Input Flag for ADCB_EXTMUXSEL2 Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="ADCB_EXTMUXSEL3" description="Input Flag for ADCB_EXTMUXSEL3 Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="ADCC_EXTMUXSEL0" description="Input Flag for ADCC_EXTMUXSEL0 Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="ADCC_EXTMUXSEL1" description="Input Flag for ADCC_EXTMUXSEL1 Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="ADCC_EXTMUXSEL2" description="Input Flag for ADCC_EXTMUXSEL2 Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="ADCC_EXTMUXSEL3" description="Input Flag for ADCC_EXTMUXSEL3 Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="PIEERR" description="Input Flag for PIEERR Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="ECCERR" description="Input Flag for ECCERR Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="EPG1_EPGOUT0" description="Input Flag for EPG1_EPGOUT0 Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="EPG1_EPGOUT1" description="Input Flag for EPG1_EPGOUT1 Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="EPG1_EPGOUT2" description="Input Flag for EPG1_EPGOUT2 Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="EPG1_EPGOUT3" description="Input Flag for EPG1_EPGOUT3 Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG14" width="32" page="1" offset="0x1a" internal="0" description="X-Bar Input Flag Register 14">
		<bitfield id="SD3FLT1_COMPH" description="Input Flag for SD3FLT1_COMPH Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT1_COMPL" description="Input Flag for SD3FLT1_COMPL Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT2_COMPH" description="Input Flag for SD3FLT2_COMPH Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT2_COMPL" description="Input Flag for SD3FLT2_COMPL Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT3_COMPH" description="Input Flag for SD3FLT3_COMPH Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT3_COMPL" description="Input Flag for SD3FLT3_COMPL Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT4_COMPH" description="Input Flag for SD3FLT4_COMPH Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="SD3FLT4_COMPL" description="Input Flag for SD3FLT4_COMPL Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT1_COMPH" description="Input Flag for SD4FLT1_COMPH Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT1_COMPL" description="Input Flag for SD4FLT1_COMPL Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT2_COMPH" description="Input Flag for SD4FLT2_COMPH Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT2_COMPL" description="Input Flag for SD4FLT2_COMPL Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT3_COMPH" description="Input Flag for SD4FLT3_COMPH Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT3_COMPL" description="Input Flag for SD4FLT3_COMPL Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT4_COMPH" description="Input Flag for SD4FLT4_COMPH Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="SD4FLT4_COMPL" description="Input Flag for SD4FLT4_COMPL Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="INPUTXBAR2_INPUT10" description="Input Flag for INPUTXBAR2_INPUT10 Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="INPUTXBAR2_INPUT11" description="Input Flag for INPUTXBAR2_INPUT11 Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="INPUTXBAR2_INPUT12" description="Input Flag for INPUTXBAR2_INPUT12 Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="INPUTXBAR2_INPUT13" description="Input Flag for INPUTXBAR2_INPUT13 Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="INPUTXBAR2_INPUT14" description="Input Flag for INPUTXBAR2_INPUT14 Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="INPUTXBAR2_INPUT7" description="Input Flag for INPUTXBAR2_INPUT7 Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="INPUTXBAR2_INPUT8" description="Input Flag for INPUTXBAR2_INPUT8 Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="INPUTXBAR2_INPUT9" description="Input Flag for INPUTXBAR2_INPUT9 Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="MCANB_FEVT0" description="Input Flag for MCANB_FEVT0 Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="MCANB_FEVT1" description="Input Flag for MCANB_FEVT1 Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="MCANB_FEVT2" description="Input Flag for MCANB_FEVT2 Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="FSIA_RX_TRIG1" description="Input Flag for FSIA_RX_TRIG1 Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="FSIB_RX_TRIG1" description="Input Flag for FSIB_RX_TRIG1 Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="FSIC_RX_TRIG1" description="Input Flag for FSIC_RX_TRIG1 Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="FSID_RX_TRIG1" description="Input Flag for FSID_RX_TRIG1 Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG15" width="32" page="1" offset="0x1c" internal="0" description="X-Bar Input Flag Register 15">
		<bitfield id="FSIRXA_TRIG_2" description="Input Flag for FSIRXA_TRIG_2 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="FSIRXA_TRIG_3" description="Input Flag for FSIRXA_TRIG_3 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="FSIRXB_TRIG_2" description="Input Flag for FSIRXB_TRIG_2 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="FSIRXB_TRIG_3" description="Input Flag for FSIRXB_TRIG_3 Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="FSIRXC_TRIG_2" description="Input Flag for FSIRXC_TRIG_2 Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="FSIRXC_TRIG_3" description="Input Flag for FSIRXC_TRIG_3 Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="FSIRXD_TRIG_2" description="Input Flag for FSIRXD_TRIG_2 Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="FSIRXD_TRIG_3" description="Input Flag for FSIRXD_TRIG_3 Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="ECAP1_TRIPOUT" description="Input Flag for ECAP1_TRIPOUT Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="ECAP2_TRIPOUT" description="Input Flag for ECAP2_TRIPOUT Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="ECAP3_TRIPOUT" description="Input Flag for ECAP3_TRIPOUT Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="ECAP4_TRIPOUT" description="Input Flag for ECAP4_TRIPOUT Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="ECAP5_TRIPOUT" description="Input Flag for ECAP5_TRIPOUT Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="ECAP6_TRIPOUT" description="Input Flag for ECAP6_TRIPOUT Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="CPU1ERADEVT10" description="Input Flag for CPU1ERADEVT10 Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="CPU1ERADEVT11" description="Input Flag for CPU1ERADEVT11 Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="CPU1ERADEVT8" description="Input Flag for CPU1ERADEVT8 Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CPU1ERADEVT9" description="Input Flag for CPU1ERADEVT9 Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="CPU1_ADCCHECKEVT1" description="Input Flag for CPU1_ADCCHECKEVT1 Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CPU1_ADCCHECKEVT2" description="Input Flag for CPU1_ADCCHECKEVT2 Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="CPU1_ADCCHECKEVT3" description="Input Flag for CPU1_ADCCHECKEVT3 Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="CPU1_ADCCHECKEVT4" description="Input Flag for CPU1_ADCCHECKEVT4 Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="CPU2ERADEVT10" description="Input Flag for CPU2ERADEVT10 Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="CPU2ERADEVT11" description="Input Flag for CPU2ERADEVT11 Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="CPU2ERADEVT8" description="Input Flag for CPU2ERADEVT8 Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="CPU2ERADEVT9" description="Input Flag for CPU2ERADEVT9 Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="CPU2_ADCCHECKEVT1" description="Input Flag for CPU2_ADCCHECKEVT1 Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="CPU2_ADCCHECKEVT2" description="Input Flag for CPU2_ADCCHECKEVT2 Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="CPU2_ADCCHECKEVT3" description="Input Flag for CPU2_ADCCHECKEVT3 Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="CPU2_ADCCHECKEVT4" description="Input Flag for CPU2_ADCCHECKEVT4 Signal" begin="29" end="29" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG16" width="32" page="1" offset="0x1e" internal="0" description="X-Bar Input Flag Register 16">
		<bitfield id="CMPSS9_CTRIPH" description="Input Flag for CMPSS9_CTRIPH Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CMPSS9_CTRIPL" description="Input Flag for CMPSS9_CTRIPL Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CMPSS9_CTRIPOUTH" description="Input Flag for CMPSS9_CTRIPOUTH Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CMPSS9_CTRIPOUTL" description="Input Flag for CMPSS9_CTRIPOUTL Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CMPSS10_CTRIPH" description="Input Flag for CMPSS10_CTRIPH Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CMPSS10_CTRIPL" description="Input Flag for CMPSS10_CTRIPL Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="CMPSS10_CTRIPOUTH" description="Input Flag for CMPSS10_CTRIPOUTH Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CMPSS10_CTRIPOUTL" description="Input Flag for CMPSS10_CTRIPOUTL Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CMPSS11_CTRIPH" description="Input Flag for CMPSS11_CTRIPH Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CMPSS11_CTRIPL" description="Input Flag for CMPSS11_CTRIPL Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="CMPSS11_CTRIPOUTH" description="Input Flag for CMPSS11_CTRIPOUTH Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="CMPSS11_CTRIPOUTL" description="Input Flag for CMPSS11_CTRIPOUTL Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="CMPSS12_CTRIPH" description="Input Flag for CMPSS12_CTRIPH Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="CMPSS12_CTRIPL" description="Input Flag for CMPSS12_CTRIPL Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="CMPSS12_CTRIPOUTH" description="Input Flag for CMPSS12_CTRIPOUTH Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="CMPSS12_CTRIPOUTL" description="Input Flag for CMPSS12_CTRIPOUTL Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="XCLKOUT" description="Input Flag for XCLKOUT Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
