IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_xbar_regs.xml
	<register id="XBARCLR1" width="32" page="1" offset="0x20" internal="0" description="X-Bar Input Flag Clear Register 1">
		<bitfield id="CMPSS1_CTRIPL" description="Input Flag Clear for CMPSS1.CTRIPL Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS1_CTRIPH" description="Input Flag Clear for CMPSS1.CTRIPH Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPL" description="Input Flag Clear for CMPSS2.CTRIPL Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPH" description="Input Flag Clear for CMPSS2.CTRIPH Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPL" description="Input Flag Clear for CMPSS3.CTRIPL Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPH" description="Input Flag Clear for CMPSS3.CTRIPH Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPL" description="Input Flag Clear for CMPSS4.CTRIPL Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPH" description="Input Flag Clear for CMPSS4.CTRIPH Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5_CTRIPL" description="Input Flag Clear for CMPSS5.CTRIPL Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5_CTRIPH" description="Input Flag Clear for CMPSS5.CTRIPH Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6_CTRIPL" description="Input Flag Clear for CMPSS6.CTRIPL Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6_CTRIPH" description="Input Flag Clear for CMPSS6.CTRIPH Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7_CTRIPL" description="Input Flag Clear for CMPSS7.CTRIPL Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7_CTRIPH" description="Input Flag Clear for CMPSS7.CTRIPH Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8_CTRIPL" description="Input Flag Clear for CMPSS8.CTRIPL Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8_CTRIPH" description="Input Flag Clear for CMPSS8.CTRIPH Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS1_CTRIPOUTL" description="Input Flag Clear for CMPSS1.CTRIPOUTL Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS1_CTRIPOUTH" description="Input Flag Clear for CMPSS1.CTRIPOUTH Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPOUTL" description="Input Flag Clear for CMPSS2.CTRIPOUTL Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPOUTH" description="Input Flag Clear for CMPSS2.CTRIPOUTH Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPOUTL" description="Input Flag Clear for CMPSS3.CTRIPOUTL Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPOUTH" description="Input Flag Clear for CMPSS3.CTRIPOUTH Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPOUTL" description="Input Flag Clear for CMPSS4.CTRIPOUTL Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPOUTH" description="Input Flag Clear for CMPSS4.CTRIPOUTH Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5_CTRIPOUTL" description="Input Flag Clear for CMPSS5.CTRIPOUTL Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5_CTRIPOUTH" description="Input Flag Clear for CMPSS5.CTRIPOUTH Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6_CTRIPOUTL" description="Input Flag Clear for CMPSS6.CTRIPOUTL Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6_CTRIPOUTH" description="Input Flag Clear for CMPSS6.CTRIPOUTH Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7_CTRIPOUTL" description="Input Flag Clear for CMPSS7.CTRIPOUTL Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7_CTRIPOUTH" description="Input Flag Clear for CMPSS7.CTRIPOUTH Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8_CTRIPOUTL" description="Input Flag Clear for CMPSS8.CTRIPOUTL Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8_CTRIPOUTH" description="Input Flag Clear for CMPSS8.CTRIPOUTH Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR2" width="32" page="1" offset="0x22" internal="0" description="X-Bar Input Flag Clear Register 2">
		<bitfield id="INPUT1" description="Input Flag Clear for INPUT1 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INPUT2" description="Input Flag Clear for INPUT2 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INPUT3" description="Input Flag Clear for INPUT3 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INPUT4" description="Input Flag Clear for INPUT4 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INPUT5" description="Input Flag Clear for INPUT5 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INPUT6" description="Input Flag Clear for INPUT6 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ADCSOCA" description="Input Flag Clear for ADCSOCA Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ADCSOCB" description="Input Flag Clear for ADCSOCB Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INPUT7" description="Input Flag Clear for INPUT7 Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INPUT8" description="Input Flag Clear for INPUT8 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INPUT9" description="Input Flag Clear for INPUT9 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INPUT10" description="Input Flag Clear for INPUT10 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INPUT11" description="Input Flag Clear for INPUT11 Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INPUT12" description="Input Flag Clear for INPUT12 Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INPUT13" description="Input Flag Clear for INPUT13 Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INPUT14" description="Input Flag Clear for INPUT14 Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ECAP1_OUT" description="Input Flag Clear for ECAP1.OUT Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2_OUT" description="Input Flag Clear for ECAP2.OUT Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ECAP3_OUT" description="Input Flag Clear for ECAP3.OUT Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ECAP4_OUT" description="Input Flag Clear for ECAP4.OUT Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="ECAP5_OUT" description="Input Flag Clear for ECAP5.OUT Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ECAP6_OUT" description="Input Flag Clear for ECAP6.OUT Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="EXTSYNCOUT" description="Input Flag Clear for EXTSYNCOUT Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ADCAEVT1" description="Input Flag Clear for ADCAEVT1 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="ADCAEVT2" description="Input Flag Clear for ADCAEVT2 Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="ADCAEVT3" description="Input Flag Clear for ADCAEVT3 Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="ADCAEVT4" description="Input Flag Clear for ADCAEVT4 Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT1" description="Input Flag Clear for ADCBEVT1 Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT2" description="Input Flag Clear for ADCBEVT2 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT3" description="Input Flag Clear for ADCBEVT3 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="ADCBEVT4" description="Input Flag Clear for ADCBEVT4 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="ADCCEVT1" description="Input Flag Clear for ADCCEVT1 Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
