IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_xbar_regs.xml
	<register id="XBARCLR3" width="32" page="1" offset="0x24" internal="0" description="X-Bar Input Flag Clear Register 3">
		<bitfield id="ADCCEVT2" description="Input Flag Clear for ADCCEVT2 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCCEVT3" description="Input Flag Clear for ADCCEVT3 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCCEVT4" description="Input Flag Clear for ADCCEVT4 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT1_COMPL" description="Input Flag Clear for SD1FLT1.COMPL Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT1_COMPH" description="Input Flag Clear for SD1FLT1.COMPH Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT2_COMPL" description="Input Flag Clear for SD1FLT2.COMPL Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT2_COMPH" description="Input Flag Clear for SD1FLT2.COMPH Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT3_COMPL" description="Input Flag Clear for SD1FLT3.COMPL Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT3_COMPH" description="Input Flag Clear for SD1FLT3.COMPH Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT4_COMPL" description="Input Flag Clear for SD1FLT4.COMPL Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SD1FLT4_COMPH" description="Input Flag Clear for SD1FLT4.COMPH Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT1_COMPL" description="Input Flag Clear for SD2FLT1.COMPL Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT1_COMPH" description="Input Flag Clear for SD2FLT1.COMPH Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT2_COMPL" description="Input Flag Clear for SD2FLT2.COMPL Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT2_COMPH" description="Input Flag Clear for SD2FLT2.COMPH Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT3_COMPL" description="Input Flag Clear for SD2FLT3.COMPL Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT3_COMPH" description="Input Flag Clear for SD2FLT3.COMPH Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT4_COMPL" description="Input Flag Clear for SD2FLT4.COMPL Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SD2FLT4_COMPH" description="Input Flag Clear for SD2FLT4.COMPH Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ECAP7_OUT" description="Input Flag clear for ECAP7.OUT Signal" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR4" width="32" page="1" offset="0x26" internal="0" description="X-Bar Input Flag Clear Register 4">
		<bitfield id="MCANA_FEVT0" description="Input Flag clear for MCANA_FEVT0 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MCANA_FEVT1" description="Input Flag clear for MCANA_FEVT1 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MCANA_FEVT2" description="Input Flag clear for MCANA_FEVT2 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT4" description="Input Flag clear for CLB1_4.1 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT5" description="Input Flag clear for CLB1_5.1 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT4" description="Input Flag clear for CLB2_4.1 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT5" description="Input Flag clear for CLB2_5.1 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT4" description="Input Flag clear for CLB3_4.1 Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT5" description="Input Flag clear for CLB3_5.1 Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT4" description="Input Flag clear for CLB4_4.1 Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT5" description="Input Flag clear for CLB4_5.1 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT4" description="Input Latch clear for CLB5_OUT4 Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT5" description="Input Latch clear for CLB5_OUT5 Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT4" description="Input Latch clear for CLB6_OUT4 Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT5" description="Input Latch clear for CLB6_OUT5 Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="ERRORSTS_ERROR" description="Input Latch clear for ERRORSTS_ERROR Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ECATSYNC0" description="Input Latch clear for ECATSYNC0 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="ECATSYNC1" description="Input Latch clear for ECATSYNC1 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CLAHALT" description="Input Flag clear for CLAHALT Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR5" width="32" page="1" offset="0x28" internal="0" description="X-Bar Input Flag Clear Register 5">
		<bitfield id="EPWM1_TRIPOUT" description="Input Flag clear for EPWM1_TRIPOUT Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2_TRIPOUT" description="Input Flag clear for EPWM2_TRIPOUT Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3_TRIPOUT" description="Input Flag clear for EPWM3_TRIPOUT Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4_TRIPOUT" description="Input Flag clear for EPWM4_TRIPOUT Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5_TRIPOUT" description="Input Flag clear for EPWM5_TRIPOUT Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6_TRIPOUT" description="Input Flag clear for EPWM6_TRIPOUT Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7_TRIPOUT" description="Input Flag clear for EPWM7_TRIPOUT Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8_TRIPOUT" description="Input Flag clear for EPWM8_TRIPOUT Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9_TRIPOUT" description="Input Flag clear for EPWM9_TRIPOUT Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10_TRIPOUT" description="Input Flag clear for EPWM10_TRIPOUT Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11_TRIPOUT" description="Input Flag clear for EPWM11_TRIPOUT Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12_TRIPOUT" description="Input Flag clear for EPWM12_TRIPOUT Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13_TRIPOUT" description="Input Flag clear for EPWM13_TRIPOUT Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14_TRIPOUT" description="Input Flag clear for EPWM14_TRIPOUT Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15_TRIPOUT" description="Input Flag clear for EPWM15_TRIPOUT Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16_TRIPOUT" description="Input Flag clear for EPWM16_TRIPOUT Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="EPWM17_TRIPOUT" description="Input Flag clear for EPWM17_TRIPOUT Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="EPWM18_TRIPOUT" description="Input Flag clear for EPWM18_TRIPOUT Signal" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR6" width="32" page="1" offset="0x2a" internal="0" description="X-Bar Input Flag Clear Register 6">
		<bitfield id="EPWM1_DEL_TRIP" description="Input Flag clear for EPWM1_DEL_TRIP Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2_DEL_TRIP" description="Input Flag clear for EPWM2_DEL_TRIP Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3_DEL_TRIP" description="Input Flag clear for EPWM3_DEL_TRIP Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4_DEL_TRIP" description="Input Flag clear for EPWM4_DEL_TRIP Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5_DEL_TRIP" description="Input Flag clear for EPWM5_DEL_TRIP Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6_DEL_TRIP" description="Input Flag clear for EPWM6_DEL_TRIP Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7_DEL_TRIP" description="Input Flag clear for EPWM7_DEL_TRIP Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8_DEL_TRIP" description="Input Flag clear for EPWM8_DEL_TRIP Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9_DEL_TRIP" description="Input Flag clear for EPWM9_DEL_TRIP Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10_DEL_TRIP" description="Input Flag clear for EPWM10_DEL_TRIP Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11_DEL_TRIP" description="Input Flag clear for EPWM11_DEL_TRIP Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12_DEL_TRIP" description="Input Flag clear for EPWM12_DEL_TRIP Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13_DEL_TRIP" description="Input Flag clear for EPWM13_DEL_TRIP Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14_DEL_TRIP" description="Input Flag clear for EPWM14_DEL_TRIP Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15_DEL_TRIP" description="Input Flag clear for EPWM15_DEL_TRIP Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16_DEL_TRIP" description="Input Flag clear for EPWM16_DEL_TRIP Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="EPWM17_DEL_TRIP" description="Input Flag clear for EPWM17_DEL_TRIP Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="EPWM18_DEL_TRIP" description="Input Flag clear for EPWM18_DEL_TRIP Signal" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR7" width="32" page="1" offset="0x2c" internal="0" description="X-Bar Input Flag Clear Register 7">
		<bitfield id="EPWM1_DEL_ACTIVE" description="Input Flag clear for EPWM1_DEL_ACTIVE Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2_DEL_ACTIVE" description="Input Flag clear for EPWM2_DEL_ACTIVE Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3_DEL_ACTIVE" description="Input Flag clear for EPWM3_DEL_ACTIVE Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4_DEL_ACTIVE" description="Input Flag clear for EPWM4_DEL_ACTIVE Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5_DEL_ACTIVE" description="Input Flag clear for EPWM5_DEL_ACTIVE Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6_DEL_ACTIVE" description="Input Flag clear for EPWM6_DEL_ACTIVE Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7_DEL_ACTIVE" description="Input Flag clear for EPWM7_DEL_ACTIVE Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8_DEL_ACTIVE" description="Input Flag clear for EPWM8_DEL_ACTIVE Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9_DEL_ACTIVE" description="Input Flag clear for EPWM9_DEL_ACTIVE Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10_DEL_ACTIVE" description="Input Flag clear for EPWM10_DEL_ACTIVE Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11_DEL_ACTIVE" description="Input Flag clear for EPWM11_DEL_ACTIVE Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12_DEL_ACTIVE" description="Input Flag clear for EPWM12_DEL_ACTIVE Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13_DEL_ACTIVE" description="Input Flag clear for EPWM13_DEL_ACTIVE Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14_DEL_ACTIVE" description="Input Flag clear for EPWM14_DEL_ACTIVE Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15_DEL_ACTIVE" description="Input Flag clear for EPWM15_DEL_ACTIVE Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16_DEL_ACTIVE" description="Input Flag clear for EPWM16_DEL_ACTIVE Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="EPWM17_DEL_ACTIVE" description="Input Flag clear for EPWM17_DEL_ACTIVE Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="EPWM18_DEL_ACTIVE" description="Input Flag clear for EPWM18_DEL_ACTIVE Signal" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR8" width="32" page="1" offset="0x2e" internal="0" description="X-Bar Input Flag Clear Register 8">
		<bitfield id="ETPWM1_A0_sclk" description="Input Flag clear for ETPWM1_A0_sclk Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM1_B0_sclk" description="Input Flag clear for ETPWM1_B0_sclk Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM2_A0_sclk" description="Input Flag clear for ETPWM2_A0_sclk Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM2_B0_sclk" description="Input Flag clear for ETPWM2_B0_sclk Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM3_A0_sclk" description="Input Flag clear for ETPWM3_A0_sclk Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM3_B0_sclk" description="Input Flag clear for ETPWM3_B0_sclk Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM4_A0_sclk" description="Input Flag clear for ETPWM4_A0_sclk Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM4_B0_sclk" description="Input Flag clear for ETPWM4_B0_sclk Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM5_A0_sclk" description="Input Flag clear for ETPWM5_A0_sclk Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM5_B0_sclk" description="Input Flag clear for ETPWM5_B0_sclk Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM6_A0_sclk" description="Input Flag clear for ETPWM6_A0_sclk Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM6_B0_sclk" description="Input Flag clear for ETPWM6_B0_sclk Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM7_A0_sclk" description="Input Flag clear for ETPWM7_A0_sclk Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM7_B0_sclk" description="Input Flag clear for ETPWM7_B0_sclk Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM8_A0_sclk" description="Input Flag clear for ETPWM8_A0_sclk Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM8_B0_sclk" description="Input Flag clear for ETPWM8_B0_sclk Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM9_A0_sclk" description="Input Flag clear for ETPWM9_A0_sclk Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM9_B0_sclk" description="Input Flag clear for ETPWM9_B0_sclk Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM10_A0_sclk" description="Input Flag clear for ETPWM10_A0_sclk Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM10_B0_sclk" description="Input Flag clear for ETPWM10_B0_sclk Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM11_A0_sclk" description="Input Flag clear for ETPWM11_A0_sclk Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM11_B0_sclk" description="Input Flag clear for ETPWM11_B0_sclk Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM12_A0_sclk" description="Input Flag clear for ETPWM12_A0_sclk Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM12_B0_sclk" description="Input Flag clear for ETPWM12_B0_sclk Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM13_A0_sclk" description="Input Flag clear for ETPWM13_A0_sclk Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM13_B0_sclk" description="Input Flag clear for ETPWM13_B0_sclk Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM14_A0_sclk" description="Input Flag clear for ETPWM14_A0_sclk Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM14_B0_sclk" description="Input Flag clear for ETPWM14_B0_sclk Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM15_A0_sclk" description="Input Flag clear for ETPWM15_A0_sclk Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM15_B0_sclk" description="Input Flag clear for ETPWM15_B0_sclk Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM16_A0_sclk" description="Input Flag clear for ETPWM16_A0_sclk Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM16_B0_sclk" description="Input Flag clear for ETPWM16_B0_sclk Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR9" width="32" page="1" offset="0x30" internal="0" description="X-Bar Input Flag Clear Register 9">
		<bitfield id="ETPWM17_A0_sclk" description="Input Flag clear for ETPWM17_A0_sclk Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM17_B0_sclk" description="Input Flag clear for ETPWM17_B0_sclk Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM18_A0_sclk" description="Input Flag clear for ETPWM18_A0_sclk Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ETPWM18_B0_sclk" description="Input Flag clear for ETPWM18_B0_sclk Signal" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR10" width="32" page="1" offset="0x32" internal="0" description="X-Bar Input Flag Clear Register 10">
		<bitfield id="MDL1_OUTA" description="Input Flag clear for MDL1_OUTA Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MDL1_OUTB" description="Input Flag clear for MDL1_OUTB Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MDL2_OUTA" description="Input Flag clear for MDL2_OUTA Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MDL2_OUTB" description="Input Flag clear for MDL2_OUTB Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MDL3_OUTA" description="Input Flag clear for MDL3_OUTA Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MDL3_OUTB" description="Input Flag clear for MDL3_OUTB Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MDL4_OUTA" description="Input Flag clear for MDL4_OUTA Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MDL4_OUTB" description="Input Flag clear for MDL4_OUTB Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MDL5_OUTA" description="Input Flag clear for MDL5_OUTA Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MDL5_OUTB" description="Input Flag clear for MDL5_OUTB Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MDL6_OUTA" description="Input Flag clear for MDL6_OUTA Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MDL6_OUTB" description="Input Flag clear for MDL6_OUTB Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MDL7_OUTA" description="Input Flag clear for MDL7_OUTA Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MDL7_OUTB" description="Input Flag clear for MDL7_OUTB Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="MDL8_OUTA" description="Input Flag clear for MDL8_OUTA Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MDL8_OUTB" description="Input Flag clear for MDL8_OUTB Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="MDL9_OUTA" description="Input Flag clear for MDL9_OUTA Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MDL9_OUTB" description="Input Flag clear for MDL9_OUTB Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="MDL10_OUTA" description="Input Flag clear for MDL10_OUTA Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="MDL10_OUTB" description="Input Flag clear for MDL10_OUTB Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="MDL11_OUTA" description="Input Flag clear for MDL11_OUTA Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="MDL11_OUTB" description="Input Flag clear for MDL11_OUTB Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="MDL12_OUTA" description="Input Flag clear for MDL12_OUTA Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="MDL12_OUTB" description="Input Flag clear for MDL12_OUTB Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="MDL13_OUTA" description="Input Flag clear for MDL13_OUTA Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="MDL13_OUTB" description="Input Flag clear for MDL13_OUTB Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="MDL14_OUTA" description="Input Flag clear for MDL14_OUTA Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="MDL14_OUTB" description="Input Flag clear for MDL14_OUTB Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="MDL15_OUTA" description="Input Flag clear for MDL15_OUTA Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="MDL15_OUTB" description="Input Flag clear for MDL15_OUTB Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="MDL16_OUTA" description="Input Flag clear for MDL16_OUTA Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="MDL16_OUTB" description="Input Flag clear for MDL16_OUTB Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR11" width="32" page="1" offset="0x34" internal="0" description="X-Bar Input Flag Clear Register 11">
		<bitfield id="MDL17_OUTA" description="Input Flag clear for MDL17_OUTA Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MDL17_OUTB" description="Input Flag clear for MDL17_OUTB Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MDL18_OUTA" description="Input Flag clear for MDL18_OUTA Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MDL18_OUTB" description="Input Flag clear for MDL18_OUTB Signal" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
