IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_xbar_regs.xml
	<register id="XBARCLR12" width="32" page="1" offset="0x36" internal="0" description="X-Bar Input Flag Clear Register 12">
		<bitfield id="CLB1_OUT0" description="Input Flag clear for CLB1_OUT0 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT1" description="Input Flag clear for CLB1_OUT1 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT2" description="Input Flag clear for CLB1_OUT2 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT3" description="Input Flag clear for CLB1_OUT3 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT6" description="Input Flag clear for CLB1_OUT6 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLB1_OUT7" description="Input Flag clear for CLB1_OUT7 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT0" description="Input Flag clear for CLB2_OUT0 Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT1" description="Input Flag clear for CLB2_OUT1 Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT2" description="Input Flag clear for CLB2_OUT2 Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT3" description="Input Flag clear for CLB2_OUT3 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT6" description="Input Flag clear for CLB2_OUT6 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CLB2_OUT7" description="Input Flag clear for CLB2_OUT7 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT0" description="Input Flag clear for CLB3_OUT0 Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT1" description="Input Flag clear for CLB3_OUT1 Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT2" description="Input Flag clear for CLB3_OUT2 Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT3" description="Input Flag clear for CLB3_OUT3 Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT6" description="Input Flag clear for CLB3_OUT6 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CLB3_OUT7" description="Input Flag clear for CLB3_OUT7 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT0" description="Input Flag clear for CLB4_OUT0 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT1" description="Input Flag clear for CLB4_OUT1 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT2" description="Input Flag clear for CLB4_OUT2 Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT3" description="Input Flag clear for CLB4_OUT3 Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT6" description="Input Flag clear for CLB4_OUT6 Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CLB4_OUT7" description="Input Flag clear for CLB4_OUT7 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT0" description="Input Flag clear for CLB5_OUT0 Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT1" description="Input Flag clear for CLB5_OUT1 Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT2" description="Input Flag clear for CLB5_OUT2 Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT3" description="Input Flag clear for CLB5_OUT3 Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT6" description="Input Flag clear for CLB5_OUT6 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_OUT7" description="Input Flag clear for CLB5_OUT7 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT0" description="Input Flag clear for CLB6_OUT0 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT1" description="Input Flag clear for CLB6_OUT1 Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR13" width="32" page="1" offset="0x38" internal="0" description="X-Bar Input Flag Clear Register 13">
		<bitfield id="CLB6_OUT2" description="Input Flag clear for CLB6_OUT2 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT3" description="Input Flag clear for CLB6_OUT3 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT6" description="Input Flag clear for CLB6_OUT6 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_OUT7" description="Input Flag clear for CLB6_OUT7 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="XTRIPOUT1" description="Input Flag clear for XTRIPOUT1 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="XTRIPOUT2" description="Input Flag clear for XTRIPOUT2 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="XTRIPOUT3" description="Input Flag clear for XTRIPOUT3 Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="XTRIPOUT4" description="Input Flag clear for XTRIPOUT4 Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="XTRIPOUT5" description="Input Flag clear for XTRIPOUT5 Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="XTRIPOUT6" description="Input Flag clear for XTRIPOUT6 Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="XTRIPOUT7" description="Input Flag clear for XTRIPOUT7 Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="XTRIPOUT8" description="Input Flag clear for XTRIPOUT8 Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="ADCA_EXTMUXSEL0" description="Input Flag clear for ADCA_EXTMUXSEL0 Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ADCA_EXTMUXSEL1" description="Input Flag clear for ADCA_EXTMUXSEL1 Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ADCA_EXTMUXSEL2" description="Input Flag clear for ADCA_EXTMUXSEL2 Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ADCA_EXTMUXSEL3" description="Input Flag clear for ADCA_EXTMUXSEL3 Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ADCB_EXTMUXSEL0" description="Input Flag clear for ADCB_EXTMUXSEL0 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ADCB_EXTMUXSEL1" description="Input Flag clear for ADCB_EXTMUXSEL1 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ADCB_EXTMUXSEL2" description="Input Flag clear for ADCB_EXTMUXSEL2 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ADCB_EXTMUXSEL3" description="Input Flag clear for ADCB_EXTMUXSEL3 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="ADCC_EXTMUXSEL0" description="Input Flag clear for ADCC_EXTMUXSEL0 Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ADCC_EXTMUXSEL1" description="Input Flag clear for ADCC_EXTMUXSEL1 Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ADCC_EXTMUXSEL2" description="Input Flag clear for ADCC_EXTMUXSEL2 Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ADCC_EXTMUXSEL3" description="Input Flag clear for ADCC_EXTMUXSEL3 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="PIEERR" description="Input Flag clear for PIEERR Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="ECCERR" description="Input Flag clear for ECCERR Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="EPG1_EPGOUT0" description="Input Flag clear for EPG1_EPGOUT0 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="EPG1_EPGOUT1" description="Input Flag clear for EPG1_EPGOUT1 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="EPG1_EPGOUT2" description="Input Flag clear for EPG1_EPGOUT2 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="EPG1_EPGOUT3" description="Input Flag clear for EPG1_EPGOUT3 Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
