IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_xbar_regs.xml
	<register id="XBARCLR14" width="32" page="1" offset="0x3a" internal="0" description="X-Bar Input Flag Clear Register 14">
		<bitfield id="SD3FLT1_COMPH" description="Input Flag clear for SD3FLT1_COMPH Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT1_COMPL" description="Input Flag clear for SD3FLT1_COMPL Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT2_COMPH" description="Input Flag clear for SD3FLT2_COMPH Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT2_COMPL" description="Input Flag clear for SD3FLT2_COMPL Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT3_COMPH" description="Input Flag clear for SD3FLT3_COMPH Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT3_COMPL" description="Input Flag clear for SD3FLT3_COMPL Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT4_COMPH" description="Input Flag clear for SD3FLT4_COMPH Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SD3FLT4_COMPL" description="Input Flag clear for SD3FLT4_COMPL Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT1_COMPH" description="Input Flag clear for SD4FLT1_COMPH Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT1_COMPL" description="Input Flag clear for SD4FLT1_COMPL Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT2_COMPH" description="Input Flag clear for SD4FLT2_COMPH Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT2_COMPL" description="Input Flag clear for SD4FLT2_COMPL Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT3_COMPH" description="Input Flag clear for SD4FLT3_COMPH Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT3_COMPL" description="Input Flag clear for SD4FLT3_COMPL Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT4_COMPH" description="Input Flag clear for SD4FLT4_COMPH Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SD4FLT4_COMPL" description="Input Flag clear for SD4FLT4_COMPL Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="INPUTXBAR2_INPUT10" description="Input Flag clear for INPUTXBAR2_INPUT10 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="INPUTXBAR2_INPUT11" description="Input Flag clear for INPUTXBAR2_INPUT11 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="INPUTXBAR2_INPUT12" description="Input Flag clear for INPUTXBAR2_INPUT12 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="INPUTXBAR2_INPUT13" description="Input Flag clear for INPUTXBAR2_INPUT13 Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="INPUTXBAR2_INPUT14" description="Input Flag clear for INPUTXBAR2_INPUT14 Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="INPUTXBAR2_INPUT7" description="Input Flag clear for INPUTXBAR2_INPUT7 Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="INPUTXBAR2_INPUT8" description="Input Flag clear for INPUTXBAR2_INPUT8 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="INPUTXBAR2_INPUT9" description="Input Flag clear for INPUTXBAR2_INPUT9 Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="MCANB_FEVT0" description="Input Flag clear for MCANB_FEVT0 Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="MCANB_FEVT1" description="Input Flag clear for MCANB_FEVT1 Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="MCANB_FEVT2" description="Input Flag clear for MCANB_FEVT2 Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="FSIA_RX_TRIG1" description="Input Flag clear for FSIA_RX_TRIG1 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="FSIB_RX_TRIG1" description="Input Flag clear for FSIB_RX_TRIG1 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="FSIC_RX_TRIG1" description="Input Flag clear for FSIC_RX_TRIG1 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="FSID_RX_TRIG1" description="Input Flag clear for FSID_RX_TRIG1 Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="XBARCLR15" width="32" page="1" offset="0x3c" internal="0" description="X-Bar Input Flag Clear Register 15">
		<bitfield id="FSIRXA_TRIG_2" description="Input Flag clear for FSIRXA_TRIG_2 Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXA_TRIG_3" description="Input Flag clear for FSIRXA_TRIG_3 Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXB_TRIG_2" description="Input Flag clear for FSIRXB_TRIG_2 Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXB_TRIG_3" description="Input Flag clear for FSIRXB_TRIG_3 Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXC_TRIG_2" description="Input Flag clear for FSIRXC_TRIG_2 Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXC_TRIG_3" description="Input Flag clear for FSIRXC_TRIG_3 Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXD_TRIG_2" description="Input Flag clear for FSIRXD_TRIG_2 Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="FSIRXD_TRIG_3" description="Input Flag clear for FSIRXD_TRIG_3 Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ECAP1_TRIPOUT" description="Input Flag clear for ECAP1_TRIPOUT Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2_TRIPOUT" description="Input Flag clear for ECAP2_TRIPOUT Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ECAP3_TRIPOUT" description="Input Flag clear for ECAP3_TRIPOUT Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="ECAP4_TRIPOUT" description="Input Flag clear for ECAP4_TRIPOUT Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="ECAP5_TRIPOUT" description="Input Flag clear for ECAP5_TRIPOUT Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ECAP6_TRIPOUT" description="Input Flag clear for ECAP6_TRIPOUT Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CPU1ERADEVT10" description="Input Flag clear for CPU1ERADEVT10 Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CPU1ERADEVT11" description="Input Flag clear for CPU1ERADEVT11 Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CPU1ERADEVT8" description="Input Flag clear for CPU1ERADEVT8 Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPU1ERADEVT9" description="Input Flag clear for CPU1ERADEVT9 Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ADCCHECKEVT1" description="Input Flag clear for CPU1_ADCCHECKEVT1 Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ADCCHECKEVT2" description="Input Flag clear for CPU1_ADCCHECKEVT2 Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ADCCHECKEVT3" description="Input Flag clear for CPU1_ADCCHECKEVT3 Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ADCCHECKEVT4" description="Input Flag clear for CPU1_ADCCHECKEVT4 Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CPU2ERADEVT10" description="Input Flag clear for CPU2ERADEVT10 Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CPU2ERADEVT11" description="Input Flag clear for CPU2ERADEVT11 Signal" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CPU2ERADEVT8" description="Input Flag clear for CPU2ERADEVT8 Signal" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPU2ERADEVT9" description="Input Flag clear for CPU2ERADEVT9 Signal" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_ADCCHECKEVT1" description="Input Flag clear for CPU2_ADCCHECKEVT1 Signal" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_ADCCHECKEVT2" description="Input Flag clear for CPU2_ADCCHECKEVT2 Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_ADCCHECKEVT3" description="Input Flag clear for CPU2_ADCCHECKEVT3 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_ADCCHECKEVT4" description="Input Flag clear for CPU2_ADCCHECKEVT4 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
	</register>
