IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_xbar_regs.xml
	<register id="XBARCLR16" width="32" page="1" offset="0x3e" internal="0" description="X-Bar Input Flag Clear Register 16">
		<bitfield id="CMPSS9_CTRIPH" description="Input Flag clear for CMPSS9_CTRIPH Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9_CTRIPL" description="Input Flag clear for CMPSS9_CTRIPL Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9_CTRIPOUTH" description="Input Flag clear for CMPSS9_CTRIPOUTH Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9_CTRIPOUTL" description="Input Flag clear for CMPSS9_CTRIPOUTL Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10_CTRIPH" description="Input Flag clear for CMPSS10_CTRIPH Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10_CTRIPL" description="Input Flag clear for CMPSS10_CTRIPL Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10_CTRIPOUTH" description="Input Flag clear for CMPSS10_CTRIPOUTH Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10_CTRIPOUTL" description="Input Flag clear for CMPSS10_CTRIPOUTL Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11_CTRIPH" description="Input Flag clear for CMPSS11_CTRIPH Signal" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11_CTRIPL" description="Input Flag clear for CMPSS11_CTRIPL Signal" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11_CTRIPOUTH" description="Input Flag clear for CMPSS11_CTRIPOUTH Signal" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11_CTRIPOUTL" description="Input Flag clear for CMPSS11_CTRIPOUTL Signal" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12_CTRIPH" description="Input Flag clear for CMPSS12_CTRIPH Signal" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12_CTRIPL" description="Input Flag clear for CMPSS12_CTRIPL Signal" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12_CTRIPOUTH" description="Input Flag clear for CMPSS12_CTRIPOUTH Signal" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS12_CTRIPOUTL" description="Input Flag clear for CMPSS12_CTRIPOUTL Signal" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_4_1" description="Input Flag clear for CLB5_4_1  Signal" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CLB5_5_1" description="Input Flag clear for CLB5_5_1 Signal" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_4_1" description="Input Flag clear for CLB6_4_1 Signal" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="CLB6_5_1" description="Input Flag clear for CLB6_5_1 Signal" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="XCLKOUT" description="Input Flag clear for XCLKOUT Signal" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
</module>
